# Автор: Ира Данилова
# Задача: Удаление символа @

srcStr = input("Введите строку: ")

value = srcStr.replace('@', '')

print(value)

