# Created by Olesya Bandurina
# Date 20.10.2018
# Task Description: Найдите наибольшее значение в списке и индекс последнего элемента

a = input().split()
a = (max(a))
print(max(a))

